Autodesk.Revit.DB.Electrical.CableTrayConduitBase.IsValidEndPoints(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Identifies if two end points are valid.
Remarks:
The two points should not be too close.
startPoint:
The start point of the location line.
endPoint:
The end point of the location line.
Returns:
True if the two end points are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.CableTrayConduitBase.IsValidLevelId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies if a level id is valid.
document:
The document.
levelId:
The level id.
Returns:
True if the level id is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null